oxhugo/blog/inbox.org
#+TITLE: 码农农场
#+STARTUP： content inlineimages
#+AUTHOR: Evilee
#+PROPERTY: header-args :eval no
#+LANGUAGE: zh-CN
#+OPTIONS: creator:t toc:nil
#+HUGO_BASE_DIR: ../../
#+HUGO_AUTO_SET_LASTMOD: f
#+HUGO_SECTION: blog
#+HUGO_CUSTOM_FRONT_MATTER: :authorbox true :comments true :toc false :mathjax true

** TODO 初识 SwiftNIO                                                          :@计算机:Swift:SwiftNIO:
:PROPERTIES:
:EXPORT_DATE: 2020-02-20
:EXPORT_FILE_NAME: intro-swiftnio2
:END:

=SwiftNIO= 是 SSWG (Swift Server Working Group) 最重要的基础组件之一, =Kitura=,
=Perfect=, =Vapor= 都基于 =SwiftNIO=.

<!--more-->

当然，如果只是基于以上三个框架进行开发，或者主要关注于 HTTP 层的开发，是没有必
要去了解 =SwiftNIO= 的。但如进行比较复杂的非阻塞模型开发的话，=SwiftNIO= 有着不
小的帮助。

或许你接触过 RxSwift 或者 ES6, 那么对 future, promise 等不会陌生. 但是小心，这里
有很多陷阱。ES6 中的 promise 和 RxSwift 中的 observable 很相似，但是 SwiftNIO 中
的 promise 确是和 RxSwift 中的 observer 相似。
